# Core Utils
brew "coreutils"

# Special case for bun requires a tap first
tap "oven-sh/bun"

# Programming Languages and Frameworks
brew "node"
brew "deno"
brew "nvm"
brew "bun"
brew "pnpm"
brew "python"
brew "go"
brew "rust"

# Kubernetes
brew "helm"
brew "kubernetes-cli"
brew "kubectx"

# CLI Tools
brew "git"
brew "ffmpeg"
brew "wget"
brew "fzf"
brew "jq"
brew "yq"
brew "ripgrep"
brew "hexyl"
brew "zellij"
brew "btop"
brew "eza"
brew "yazi"
brew "bat"
brew "zoxide"
brew "k9s"
brew "lazygit"
brew "lazydocker"
brew "delta"
brew "neovim"
brew "uv"
brew "ctop"
brew "btop"
brew "gping"
brew "fd"
brew "hexyl"
brew "starship"

# Zsh Enhancements
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-autocomplete"
brew "zsh-you-should-use"

# GUI Applications
cask "firefox"
cask "google-chrome"
cask "github"
cask "visual-studio-code"
cask "cursor"
cask "raycast"
cask "rectangle"
cask "mockoon"
cask "ghostty"
cask "docker"
cask "keka"
cask "sloth"
cask "stats"
cask "shottr"
cask "sublime-text"
cask "bruno"
cask "proxyman"
cask "obsidian"
cask "freelens"
cask "vlc", args: { work_mode: false }

# Fonts
tap "homebrew/cask-fonts"
cask "font-fira-mono-nerd-font"

# Personal applications (non-work mode)
cask "notion", args: { work_mode: false }
cask "telegram", args: { work_mode: false }
cask "cleanshot", args: { work_mode: false }
cask "whatsapp", args: { work_mode: false }
cask "qbittorrent", args: { work_mode: false }
cask "calibre", args: { work_mode: false }
cask "db-browser-for-sqlite", args: { work_mode: false }
cask "spotify", args: { work_mode: false }
